zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcw.h
/* -------- FCW_MUTEX : (FCW Offset: 0x08) (R/W 32) MUTEX REGISTER -------- */
#define FCW_MUTEX_RESETVALUE                  _UINT32_(0x00)                                       /*  (FCW_MUTEX) MUTEX REGISTER  Reset Value */

#define FCW_MUTEX_LOCK_Pos                    _UINT32_(0)                                          /* (FCW_MUTEX) Flash Write Controller (FCW) Lock by Owner Position */
#define FCW_MUTEX_LOCK_Msk                    (_UINT32_(0x1) << FCW_MUTEX_LOCK_Pos)                /* (FCW_MUTEX) Flash Write Controller (FCW) Lock by Owner Mask */
#define FCW_MUTEX_LOCK(value)                 (FCW_MUTEX_LOCK_Msk & (_UINT32_(value) << FCW_MUTEX_LOCK_Pos)) /* Assignment of value for LOCK in the FCW_MUTEX register */
#define   FCW_MUTEX_LOCK_UNLOCK_Val           _UINT32_(0x0)                                        /* (FCW_MUTEX) FCW is not locked  */
#define   FCW_MUTEX_LOCK_LOCK_Val             _UINT32_(0x1)                                        /* (FCW_MUTEX) FCW is locked by owner  */
#define FCW_MUTEX_LOCK_UNLOCK                 (FCW_MUTEX_LOCK_UNLOCK_Val << FCW_MUTEX_LOCK_Pos)    /* (FCW_MUTEX) FCW is not locked Position */
#define FCW_MUTEX_LOCK_LOCK                   (FCW_MUTEX_LOCK_LOCK_Val << FCW_MUTEX_LOCK_Pos)      /* (FCW_MUTEX) FCW is locked by owner Position */
#define FCW_MUTEX_OWNER_Pos                   _UINT32_(1)                                          /* (FCW_MUTEX) Flash Write Controller (FCW) Owner ID Position */
#define FCW_MUTEX_OWNER_Msk                   (_UINT32_(0x3) << FCW_MUTEX_OWNER_Pos)               /* (FCW_MUTEX) Flash Write Controller (FCW) Owner ID Mask */
#define FCW_MUTEX_OWNER(value)                (FCW_MUTEX_OWNER_Msk & (_UINT32_(value) << FCW_MUTEX_OWNER_Pos)) /* Assignment of value for OWNER in the FCW_MUTEX register */
#define   FCW_MUTEX_OWNER_NONE_Val            _UINT32_(0x0)                                        /* (FCW_MUTEX) No Owner - always 0 if LOCK=0  */
#define   FCW_MUTEX_OWNER_SYSTEM_Val          _UINT32_(0x1)                                        /* (FCW_MUTEX) The System owns the FCW  */
#define FCW_MUTEX_OWNER_NONE                  (FCW_MUTEX_OWNER_NONE_Val << FCW_MUTEX_OWNER_Pos)    /* (FCW_MUTEX) No Owner - always 0 if LOCK=0 Position */
#define FCW_MUTEX_OWNER_SYSTEM                (FCW_MUTEX_OWNER_SYSTEM_Val << FCW_MUTEX_OWNER_Pos)  /* (FCW_MUTEX) The System owns the FCW Position */
#define FCW_MUTEX_Msk                         _UINT32_(0x00000007)                                 /* (FCW_MUTEX) Register Mask  */


/* -------- FCW_INTENCLR : (FCW Offset: 0x0C) (R/W 32) Interrupt Enable Clear REGISTER -------- */
#define FCW_INTENCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (FCW_INTENCLR) Interrupt Enable Clear REGISTER  Reset Value */

#define FCW_INTENCLR_DONE_Pos                 _UINT32_(0)                                          /* (FCW_INTENCLR) NVM Operation Done Interrupt Enable Position */
#define FCW_INTENCLR_DONE_Msk                 (_UINT32_(0x1) << FCW_INTENCLR_DONE_Pos)             /* (FCW_INTENCLR) NVM Operation Done Interrupt Enable Mask */
#define FCW_INTENCLR_DONE(value)              (FCW_INTENCLR_DONE_Msk & (_UINT32_(value) << FCW_INTENCLR_DONE_Pos)) /* Assignment of value for DONE in the FCW_INTENCLR register */
#define   FCW_INTENCLR_DONE_0_Val             _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_DONE_1_Val             _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_DONE_0                   (FCW_INTENCLR_DONE_0_Val << FCW_INTENCLR_DONE_Pos)   /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_DONE_1                   (FCW_INTENCLR_DONE_1_Val << FCW_INTENCLR_DONE_Pos)   /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_KEYERR_Pos               _UINT32_(1)                                          /* (FCW_INTENCLR) Key Error Interrupt Enable Position */
#define FCW_INTENCLR_KEYERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_KEYERR_Pos)           /* (FCW_INTENCLR) Key Error Interrupt Enable Mask */
#define FCW_INTENCLR_KEYERR(value)            (FCW_INTENCLR_KEYERR_Msk & (_UINT32_(value) << FCW_INTENCLR_KEYERR_Pos)) /* Assignment of value for KEYERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_KEYERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_KEYERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_KEYERR_0                 (FCW_INTENCLR_KEYERR_0_Val << FCW_INTENCLR_KEYERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_KEYERR_1                 (FCW_INTENCLR_KEYERR_1_Val << FCW_INTENCLR_KEYERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_CFGERR_Pos               _UINT32_(2)                                          /* (FCW_INTENCLR) Configuration Error Interrupt Enable Position */
#define FCW_INTENCLR_CFGERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_CFGERR_Pos)           /* (FCW_INTENCLR) Configuration Error Interrupt Enable Mask */
#define FCW_INTENCLR_CFGERR(value)            (FCW_INTENCLR_CFGERR_Msk & (_UINT32_(value) << FCW_INTENCLR_CFGERR_Pos)) /* Assignment of value for CFGERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_CFGERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_CFGERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_CFGERR_0                 (FCW_INTENCLR_CFGERR_0_Val << FCW_INTENCLR_CFGERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_CFGERR_1                 (FCW_INTENCLR_CFGERR_1_Val << FCW_INTENCLR_CFGERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_FIFOERR_Pos              _UINT32_(3)                                          /* (FCW_INTENCLR) FIFO Underrun during Row Write Interrupt Enable Position */
#define FCW_INTENCLR_FIFOERR_Msk              (_UINT32_(0x1) << FCW_INTENCLR_FIFOERR_Pos)          /* (FCW_INTENCLR) FIFO Underrun during Row Write Interrupt Enable Mask */
#define FCW_INTENCLR_FIFOERR(value)           (FCW_INTENCLR_FIFOERR_Msk & (_UINT32_(value) << FCW_INTENCLR_FIFOERR_Pos)) /* Assignment of value for FIFOERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_FIFOERR_0_Val          _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_FIFOERR_1_Val          _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_FIFOERR_0                (FCW_INTENCLR_FIFOERR_0_Val << FCW_INTENCLR_FIFOERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_FIFOERR_1                (FCW_INTENCLR_FIFOERR_1_Val << FCW_INTENCLR_FIFOERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_BUSERR_Pos               _UINT32_(4)                                          /* (FCW_INTENCLR) AHB Bus Error during Row Write Interrupt Enable Position */
#define FCW_INTENCLR_BUSERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_BUSERR_Pos)           /* (FCW_INTENCLR) AHB Bus Error during Row Write Interrupt Enable Mask */
#define FCW_INTENCLR_BUSERR(value)            (FCW_INTENCLR_BUSERR_Msk & (_UINT32_(value) << FCW_INTENCLR_BUSERR_Pos)) /* Assignment of value for BUSERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_BUSERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_BUSERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_BUSERR_0                 (FCW_INTENCLR_BUSERR_0_Val << FCW_INTENCLR_BUSERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_BUSERR_1                 (FCW_INTENCLR_BUSERR_1_Val << FCW_INTENCLR_BUSERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_WPERR_Pos                _UINT32_(5)                                          /* (FCW_INTENCLR) Write Protection Error Interrupt Enable Position */
#define FCW_INTENCLR_WPERR_Msk                (_UINT32_(0x1) << FCW_INTENCLR_WPERR_Pos)            /* (FCW_INTENCLR) Write Protection Error Interrupt Enable Mask */
#define FCW_INTENCLR_WPERR(value)             (FCW_INTENCLR_WPERR_Msk & (_UINT32_(value) << FCW_INTENCLR_WPERR_Pos)) /* Assignment of value for WPERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_WPERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_WPERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_WPERR_0                  (FCW_INTENCLR_WPERR_0_Val << FCW_INTENCLR_WPERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_WPERR_1                  (FCW_INTENCLR_WPERR_1_Val << FCW_INTENCLR_WPERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_OPERR_Pos                _UINT32_(6)                                          /* (FCW_INTENCLR) NVMOP Error Interrupt Enable Position */
#define FCW_INTENCLR_OPERR_Msk                (_UINT32_(0x1) << FCW_INTENCLR_OPERR_Pos)            /* (FCW_INTENCLR) NVMOP Error Interrupt Enable Mask */
#define FCW_INTENCLR_OPERR(value)             (FCW_INTENCLR_OPERR_Msk & (_UINT32_(value) << FCW_INTENCLR_OPERR_Pos)) /* Assignment of value for OPERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_OPERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_OPERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_OPERR_0                  (FCW_INTENCLR_OPERR_0_Val << FCW_INTENCLR_OPERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_OPERR_1                  (FCW_INTENCLR_OPERR_1_Val << FCW_INTENCLR_OPERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_HTDPGM_Pos               _UINT32_(8)                                          /* (FCW_INTENCLR) High Temperature Detect Error Interrupt Enable Position */
#define FCW_INTENCLR_HTDPGM_Msk               (_UINT32_(0x1) << FCW_INTENCLR_HTDPGM_Pos)           /* (FCW_INTENCLR) High Temperature Detect Error Interrupt Enable Mask */
#define FCW_INTENCLR_HTDPGM(value)            (FCW_INTENCLR_HTDPGM_Msk & (_UINT32_(value) << FCW_INTENCLR_HTDPGM_Pos)) /* Assignment of value for HTDPGM in the FCW_INTENCLR register */
#define   FCW_INTENCLR_HTDPGM_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_HTDPGM_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_HTDPGM_0                 (FCW_INTENCLR_HTDPGM_0_Val << FCW_INTENCLR_HTDPGM_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_HTDPGM_1                 (FCW_INTENCLR_HTDPGM_1_Val << FCW_INTENCLR_HTDPGM_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_RSTERR_Pos               _UINT32_(12)                                         /* (FCW_INTENCLR) Reset or Brown Out Detect Error Interrupt Enable Position */
#define FCW_INTENCLR_RSTERR_Msk               (_UINT32_(0x1) << FCW_INTENCLR_RSTERR_Pos)           /* (FCW_INTENCLR) Reset or Brown Out Detect Error Interrupt Enable Mask */
#define FCW_INTENCLR_RSTERR(value)            (FCW_INTENCLR_RSTERR_Msk & (_UINT32_(value) << FCW_INTENCLR_RSTERR_Pos)) /* Assignment of value for RSTERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_RSTERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_RSTERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_RSTERR_0                 (FCW_INTENCLR_RSTERR_0_Val << FCW_INTENCLR_RSTERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_RSTERR_1                 (FCW_INTENCLR_RSTERR_1_Val << FCW_INTENCLR_RSTERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_WRERR_Pos                _UINT32_(13)                                         /* (FCW_INTENCLR) Write Error Interrupt Enable Position */
#define FCW_INTENCLR_WRERR_Msk                (_UINT32_(0x1) << FCW_INTENCLR_WRERR_Pos)            /* (FCW_INTENCLR) Write Error Interrupt Enable Mask */
#define FCW_INTENCLR_WRERR(value)             (FCW_INTENCLR_WRERR_Msk & (_UINT32_(value) << FCW_INTENCLR_WRERR_Pos)) /* Assignment of value for WRERR in the FCW_INTENCLR register */
#define   FCW_INTENCLR_WRERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTENCLR) Interrupt Disabled  */
#define   FCW_INTENCLR_WRERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTENCLR) Interrupt Enabled  */
#define FCW_INTENCLR_WRERR_0                  (FCW_INTENCLR_WRERR_0_Val << FCW_INTENCLR_WRERR_Pos) /* (FCW_INTENCLR) Interrupt Disabled Position */
#define FCW_INTENCLR_WRERR_1                  (FCW_INTENCLR_WRERR_1_Val << FCW_INTENCLR_WRERR_Pos) /* (FCW_INTENCLR) Interrupt Enabled Position */
#define FCW_INTENCLR_Msk                      _UINT32_(0x0000317F)                                 /* (FCW_INTENCLR) Register Mask  */


/* -------- FCW_INTENSET : (FCW Offset: 0x10) (R/W 32) Interrupt Enable Set REGISTER -------- */
#define FCW_INTENSET_RESETVALUE               _UINT32_(0x00)                                       /*  (FCW_INTENSET) Interrupt Enable Set REGISTER  Reset Value */

