zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcw.h
#define FCW_INTENSET_DONE_Pos                 _UINT32_(0)                                          /* (FCW_INTENSET) NVM Operation Done Interrupt Set Enable Position */
#define FCW_INTENSET_DONE_Msk                 (_UINT32_(0x1) << FCW_INTENSET_DONE_Pos)             /* (FCW_INTENSET) NVM Operation Done Interrupt Set Enable Mask */
#define FCW_INTENSET_DONE(value)              (FCW_INTENSET_DONE_Msk & (_UINT32_(value) << FCW_INTENSET_DONE_Pos)) /* Assignment of value for DONE in the FCW_INTENSET register */
#define   FCW_INTENSET_DONE_0_Val             _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_DONE_1_Val             _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_DONE_0                   (FCW_INTENSET_DONE_0_Val << FCW_INTENSET_DONE_Pos)   /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_DONE_1                   (FCW_INTENSET_DONE_1_Val << FCW_INTENSET_DONE_Pos)   /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_KEYERR_Pos               _UINT32_(1)                                          /* (FCW_INTENSET) Key Error Interrupt Set Enable Position */
#define FCW_INTENSET_KEYERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_KEYERR_Pos)           /* (FCW_INTENSET) Key Error Interrupt Set Enable Mask */
#define FCW_INTENSET_KEYERR(value)            (FCW_INTENSET_KEYERR_Msk & (_UINT32_(value) << FCW_INTENSET_KEYERR_Pos)) /* Assignment of value for KEYERR in the FCW_INTENSET register */
#define   FCW_INTENSET_KEYERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_KEYERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_KEYERR_0                 (FCW_INTENSET_KEYERR_0_Val << FCW_INTENSET_KEYERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_KEYERR_1                 (FCW_INTENSET_KEYERR_1_Val << FCW_INTENSET_KEYERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_CFGERR_Pos               _UINT32_(2)                                          /* (FCW_INTENSET) Configuration Error Interrupt Set Enable Position */
#define FCW_INTENSET_CFGERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_CFGERR_Pos)           /* (FCW_INTENSET) Configuration Error Interrupt Set Enable Mask */
#define FCW_INTENSET_CFGERR(value)            (FCW_INTENSET_CFGERR_Msk & (_UINT32_(value) << FCW_INTENSET_CFGERR_Pos)) /* Assignment of value for CFGERR in the FCW_INTENSET register */
#define   FCW_INTENSET_CFGERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_CFGERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_CFGERR_0                 (FCW_INTENSET_CFGERR_0_Val << FCW_INTENSET_CFGERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_CFGERR_1                 (FCW_INTENSET_CFGERR_1_Val << FCW_INTENSET_CFGERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_FIFOERR_Pos              _UINT32_(3)                                          /* (FCW_INTENSET) FIFO Underrun during Row Write Interrupt Set Enable Position */
#define FCW_INTENSET_FIFOERR_Msk              (_UINT32_(0x1) << FCW_INTENSET_FIFOERR_Pos)          /* (FCW_INTENSET) FIFO Underrun during Row Write Interrupt Set Enable Mask */
#define FCW_INTENSET_FIFOERR(value)           (FCW_INTENSET_FIFOERR_Msk & (_UINT32_(value) << FCW_INTENSET_FIFOERR_Pos)) /* Assignment of value for FIFOERR in the FCW_INTENSET register */
#define   FCW_INTENSET_FIFOERR_0_Val          _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_FIFOERR_1_Val          _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_FIFOERR_0                (FCW_INTENSET_FIFOERR_0_Val << FCW_INTENSET_FIFOERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_FIFOERR_1                (FCW_INTENSET_FIFOERR_1_Val << FCW_INTENSET_FIFOERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_BUSERR_Pos               _UINT32_(4)                                          /* (FCW_INTENSET) AHB Bus Error during Row Write Interrupt Enable Position */
#define FCW_INTENSET_BUSERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_BUSERR_Pos)           /* (FCW_INTENSET) AHB Bus Error during Row Write Interrupt Enable Mask */
#define FCW_INTENSET_BUSERR(value)            (FCW_INTENSET_BUSERR_Msk & (_UINT32_(value) << FCW_INTENSET_BUSERR_Pos)) /* Assignment of value for BUSERR in the FCW_INTENSET register */
#define   FCW_INTENSET_BUSERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_BUSERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_BUSERR_0                 (FCW_INTENSET_BUSERR_0_Val << FCW_INTENSET_BUSERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_BUSERR_1                 (FCW_INTENSET_BUSERR_1_Val << FCW_INTENSET_BUSERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_WPERR_Pos                _UINT32_(5)                                          /* (FCW_INTENSET) Write Protection Error Interrupt Enable Position */
#define FCW_INTENSET_WPERR_Msk                (_UINT32_(0x1) << FCW_INTENSET_WPERR_Pos)            /* (FCW_INTENSET) Write Protection Error Interrupt Enable Mask */
#define FCW_INTENSET_WPERR(value)             (FCW_INTENSET_WPERR_Msk & (_UINT32_(value) << FCW_INTENSET_WPERR_Pos)) /* Assignment of value for WPERR in the FCW_INTENSET register */
#define   FCW_INTENSET_WPERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_WPERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_WPERR_0                  (FCW_INTENSET_WPERR_0_Val << FCW_INTENSET_WPERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_WPERR_1                  (FCW_INTENSET_WPERR_1_Val << FCW_INTENSET_WPERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_OPERR_Pos                _UINT32_(6)                                          /* (FCW_INTENSET) NVMOP Error Interrupt Enable Position */
#define FCW_INTENSET_OPERR_Msk                (_UINT32_(0x1) << FCW_INTENSET_OPERR_Pos)            /* (FCW_INTENSET) NVMOP Error Interrupt Enable Mask */
#define FCW_INTENSET_OPERR(value)             (FCW_INTENSET_OPERR_Msk & (_UINT32_(value) << FCW_INTENSET_OPERR_Pos)) /* Assignment of value for OPERR in the FCW_INTENSET register */
#define   FCW_INTENSET_OPERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_OPERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_OPERR_0                  (FCW_INTENSET_OPERR_0_Val << FCW_INTENSET_OPERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_OPERR_1                  (FCW_INTENSET_OPERR_1_Val << FCW_INTENSET_OPERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_HTDPGM_Pos               _UINT32_(8)                                          /* (FCW_INTENSET) High Temperature Detect Error Interrupt Enable Position */
#define FCW_INTENSET_HTDPGM_Msk               (_UINT32_(0x1) << FCW_INTENSET_HTDPGM_Pos)           /* (FCW_INTENSET) High Temperature Detect Error Interrupt Enable Mask */
#define FCW_INTENSET_HTDPGM(value)            (FCW_INTENSET_HTDPGM_Msk & (_UINT32_(value) << FCW_INTENSET_HTDPGM_Pos)) /* Assignment of value for HTDPGM in the FCW_INTENSET register */
#define   FCW_INTENSET_HTDPGM_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_HTDPGM_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_HTDPGM_0                 (FCW_INTENSET_HTDPGM_0_Val << FCW_INTENSET_HTDPGM_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_HTDPGM_1                 (FCW_INTENSET_HTDPGM_1_Val << FCW_INTENSET_HTDPGM_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_RSTERR_Pos               _UINT32_(12)                                         /* (FCW_INTENSET) Reset or Brown Out Detect Error Interrupt Enable Position */
#define FCW_INTENSET_RSTERR_Msk               (_UINT32_(0x1) << FCW_INTENSET_RSTERR_Pos)           /* (FCW_INTENSET) Reset or Brown Out Detect Error Interrupt Enable Mask */
#define FCW_INTENSET_RSTERR(value)            (FCW_INTENSET_RSTERR_Msk & (_UINT32_(value) << FCW_INTENSET_RSTERR_Pos)) /* Assignment of value for RSTERR in the FCW_INTENSET register */
#define   FCW_INTENSET_RSTERR_0_Val           _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_RSTERR_1_Val           _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_RSTERR_0                 (FCW_INTENSET_RSTERR_0_Val << FCW_INTENSET_RSTERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_RSTERR_1                 (FCW_INTENSET_RSTERR_1_Val << FCW_INTENSET_RSTERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_WRERR_Pos                _UINT32_(13)                                         /* (FCW_INTENSET) Write Error Interrupt Enable Position */
#define FCW_INTENSET_WRERR_Msk                (_UINT32_(0x1) << FCW_INTENSET_WRERR_Pos)            /* (FCW_INTENSET) Write Error Interrupt Enable Mask */
#define FCW_INTENSET_WRERR(value)             (FCW_INTENSET_WRERR_Msk & (_UINT32_(value) << FCW_INTENSET_WRERR_Pos)) /* Assignment of value for WRERR in the FCW_INTENSET register */
#define   FCW_INTENSET_WRERR_0_Val            _UINT32_(0x0)                                        /* (FCW_INTENSET) Interrupt Disabled  */
#define   FCW_INTENSET_WRERR_1_Val            _UINT32_(0x1)                                        /* (FCW_INTENSET) Interrupt Enabled  */
#define FCW_INTENSET_WRERR_0                  (FCW_INTENSET_WRERR_0_Val << FCW_INTENSET_WRERR_Pos) /* (FCW_INTENSET) Interrupt Disabled Position */
#define FCW_INTENSET_WRERR_1                  (FCW_INTENSET_WRERR_1_Val << FCW_INTENSET_WRERR_Pos) /* (FCW_INTENSET) Interrupt Enabled Position */
#define FCW_INTENSET_Msk                      _UINT32_(0x0000317F)                                 /* (FCW_INTENSET) Register Mask  */


/* -------- FCW_INTFLAG : (FCW Offset: 0x14) (R/W 32) Interrupt Flag REGISTER -------- */
#define FCW_INTFLAG_RESETVALUE                _UINT32_(0x00)                                       /*  (FCW_INTFLAG) Interrupt Flag REGISTER  Reset Value */

