zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcw.h
#define FCW_SRCADDR_SRCADDR_Pos               _UINT32_(0)                                          /* (FCW_SRCADDR) Source Data (Word) Address Position */
#define FCW_SRCADDR_SRCADDR_Msk               (_UINT32_(0xFFFFFFFF) << FCW_SRCADDR_SRCADDR_Pos)    /* (FCW_SRCADDR) Source Data (Word) Address Mask */
#define FCW_SRCADDR_SRCADDR(value)            (FCW_SRCADDR_SRCADDR_Msk & (_UINT32_(value) << FCW_SRCADDR_SRCADDR_Pos)) /* Assignment of value for SRCADDR in the FCW_SRCADDR register */
#define FCW_SRCADDR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (FCW_SRCADDR) Register Mask  */


/* -------- FCW_DATA : (FCW Offset: 0x2C) (R/W 32) Flash Write Data n REGISTER -------- */
#define FCW_DATA_RESETVALUE                   _UINT32_(0x00)                                       /*  (FCW_DATA) Flash Write Data n REGISTER  Reset Value */

#define FCW_DATA_DATA_Pos                     _UINT32_(0)                                          /* (FCW_DATA) Flash Write Data Position */
#define FCW_DATA_DATA_Msk                     (_UINT32_(0xFFFFFFFF) << FCW_DATA_DATA_Pos)          /* (FCW_DATA) Flash Write Data Mask */
#define FCW_DATA_DATA(value)                  (FCW_DATA_DATA_Msk & (_UINT32_(value) << FCW_DATA_DATA_Pos)) /* Assignment of value for DATA in the FCW_DATA register */
#define FCW_DATA_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (FCW_DATA) Register Mask  */


/* -------- FCW_SWAP : (FCW Offset: 0x4C) (R/W 32) NVM Panel Swap REGISTER -------- */
#define FCW_SWAP_RESETVALUE                   _UINT32_(0x00)                                       /*  (FCW_SWAP) NVM Panel Swap REGISTER  Reset Value */

#define FCW_SWAP_BFSWAP_Pos                   _UINT32_(0)                                          /* (FCW_SWAP) BFM Swap Status/Control Bit Position */
#define FCW_SWAP_BFSWAP_Msk                   (_UINT32_(0x1) << FCW_SWAP_BFSWAP_Pos)               /* (FCW_SWAP) BFM Swap Status/Control Bit Mask */
#define FCW_SWAP_BFSWAP(value)                (FCW_SWAP_BFSWAP_Msk & (_UINT32_(value) << FCW_SWAP_BFSWAP_Pos)) /* Assignment of value for BFSWAP in the FCW_SWAP register */
#define   FCW_SWAP_BFSWAP_UNSWAP_Val          _UINT32_(0x0)                                        /* (FCW_SWAP) Upper and Lower BFM Regions are NOT Swapped  */
#define   FCW_SWAP_BFSWAP_SWAP_Val            _UINT32_(0x1)                                        /* (FCW_SWAP) Upper and Lower BFM Regions are Swapped  */
#define FCW_SWAP_BFSWAP_UNSWAP                (FCW_SWAP_BFSWAP_UNSWAP_Val << FCW_SWAP_BFSWAP_Pos)  /* (FCW_SWAP) Upper and Lower BFM Regions are NOT Swapped Position */
#define FCW_SWAP_BFSWAP_SWAP                  (FCW_SWAP_BFSWAP_SWAP_Val << FCW_SWAP_BFSWAP_Pos)    /* (FCW_SWAP) Upper and Lower BFM Regions are Swapped Position */
#define FCW_SWAP_BFSLOCK_Pos                  _UINT32_(1)                                          /* (FCW_SWAP) BFM Swap Lock Bit Position */
#define FCW_SWAP_BFSLOCK_Msk                  (_UINT32_(0x1) << FCW_SWAP_BFSLOCK_Pos)              /* (FCW_SWAP) BFM Swap Lock Bit Mask */
#define FCW_SWAP_BFSLOCK(value)               (FCW_SWAP_BFSLOCK_Msk & (_UINT32_(value) << FCW_SWAP_BFSLOCK_Pos)) /* Assignment of value for BFSLOCK in the FCW_SWAP register */
#define   FCW_SWAP_BFSLOCK_UNLOCKED_Val       _UINT32_(0x0)                                        /* (FCW_SWAP) BFSLOCK and BFSWAP can be written  */
#define   FCW_SWAP_BFSLOCK_LOCKED_Val         _UINT32_(0x1)                                        /* (FCW_SWAP) BFSLOCK and BFSWAP cannot be written  */
#define FCW_SWAP_BFSLOCK_UNLOCKED             (FCW_SWAP_BFSLOCK_UNLOCKED_Val << FCW_SWAP_BFSLOCK_Pos) /* (FCW_SWAP) BFSLOCK and BFSWAP can be written Position */
#define FCW_SWAP_BFSLOCK_LOCKED               (FCW_SWAP_BFSLOCK_LOCKED_Val << FCW_SWAP_BFSLOCK_Pos) /* (FCW_SWAP) BFSLOCK and BFSWAP cannot be written Position */
#define FCW_SWAP_PFSWAP_Pos                   _UINT32_(8)                                          /* (FCW_SWAP) PFM Swap Status/Control Bit Position */
#define FCW_SWAP_PFSWAP_Msk                   (_UINT32_(0x1) << FCW_SWAP_PFSWAP_Pos)               /* (FCW_SWAP) PFM Swap Status/Control Bit Mask */
#define FCW_SWAP_PFSWAP(value)                (FCW_SWAP_PFSWAP_Msk & (_UINT32_(value) << FCW_SWAP_PFSWAP_Pos)) /* Assignment of value for PFSWAP in the FCW_SWAP register */
#define   FCW_SWAP_PFSWAP_UNSWAP_Val          _UINT32_(0x0)                                        /* (FCW_SWAP) Upper and Lower PFM Regions are NOT Swapped  */
#define   FCW_SWAP_PFSWAP_SWAP_Val            _UINT32_(0x1)                                        /* (FCW_SWAP) Upper and Lower PFM Regions are Swapped  */
#define FCW_SWAP_PFSWAP_UNSWAP                (FCW_SWAP_PFSWAP_UNSWAP_Val << FCW_SWAP_PFSWAP_Pos)  /* (FCW_SWAP) Upper and Lower PFM Regions are NOT Swapped Position */
#define FCW_SWAP_PFSWAP_SWAP                  (FCW_SWAP_PFSWAP_SWAP_Val << FCW_SWAP_PFSWAP_Pos)    /* (FCW_SWAP) Upper and Lower PFM Regions are Swapped Position */
#define FCW_SWAP_PFSLOCK_Pos                  _UINT32_(9)                                          /* (FCW_SWAP) PFM Swap Lock Bit Position */
#define FCW_SWAP_PFSLOCK_Msk                  (_UINT32_(0x1) << FCW_SWAP_PFSLOCK_Pos)              /* (FCW_SWAP) PFM Swap Lock Bit Mask */
#define FCW_SWAP_PFSLOCK(value)               (FCW_SWAP_PFSLOCK_Msk & (_UINT32_(value) << FCW_SWAP_PFSLOCK_Pos)) /* Assignment of value for PFSLOCK in the FCW_SWAP register */
#define   FCW_SWAP_PFSLOCK_UNLOCKED_Val       _UINT32_(0x0)                                        /* (FCW_SWAP) PFSLOCK and PFSWAP can be written  */
#define   FCW_SWAP_PFSLOCK_LOCKED_Val         _UINT32_(0x1)                                        /* (FCW_SWAP) PFSLOCK and PFSWAP cannot be written  */
#define FCW_SWAP_PFSLOCK_UNLOCKED             (FCW_SWAP_PFSLOCK_UNLOCKED_Val << FCW_SWAP_PFSLOCK_Pos) /* (FCW_SWAP) PFSLOCK and PFSWAP can be written Position */
#define FCW_SWAP_PFSLOCK_LOCKED               (FCW_SWAP_PFSLOCK_LOCKED_Val << FCW_SWAP_PFSLOCK_Pos) /* (FCW_SWAP) PFSLOCK and PFSWAP cannot be written Position */
#define FCW_SWAP_Msk                          _UINT32_(0x00000303)                                 /* (FCW_SWAP) Register Mask  */


