zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_sg_gc/pic32cm_sg00/include/component/fcw.h
/* -------- FCW_UBWP : (FCW Offset: 0x74) (R/W 32) Upper BFM Write Protect REGISTER -------- */
#define FCW_UBWP_RESETVALUE                   _UINT32_(0x03)                                       /*  (FCW_UBWP) Upper BFM Write Protect REGISTER  Reset Value */

#define FCW_UBWP_UBWP_Pos                     _UINT32_(0)                                          /* (FCW_UBWP) Upper Boot Pages Write Protect Bits Position */
#define FCW_UBWP_UBWP_Msk                     (_UINT32_(0x3) << FCW_UBWP_UBWP_Pos)                 /* (FCW_UBWP) Upper Boot Pages Write Protect Bits Mask */
#define FCW_UBWP_UBWP(value)                  (FCW_UBWP_UBWP_Msk & (_UINT32_(value) << FCW_UBWP_UBWP_Pos)) /* Assignment of value for UBWP in the FCW_UBWP register */
#define   FCW_UBWP_UBWP_DISABLE_Val           _UINT32_(0x0)                                        /* (FCW_UBWP) Erase and Write Protection for this Upper Boot Page is Disabled  */
#define   FCW_UBWP_UBWP_ENABLE_Val            _UINT32_(0x1)                                        /* (FCW_UBWP) Erase and Write Protection for this Upper Boot Page is Enabled  */
#define FCW_UBWP_UBWP_DISABLE                 (FCW_UBWP_UBWP_DISABLE_Val << FCW_UBWP_UBWP_Pos)     /* (FCW_UBWP) Erase and Write Protection for this Upper Boot Page is Disabled Position */
#define FCW_UBWP_UBWP_ENABLE                  (FCW_UBWP_UBWP_ENABLE_Val << FCW_UBWP_UBWP_Pos)      /* (FCW_UBWP) Erase and Write Protection for this Upper Boot Page is Enabled Position */
#define FCW_UBWP_UBWPLOCK_Pos                 _UINT32_(31)                                         /* (FCW_UBWP) UBWP Lock Bit Position */
#define FCW_UBWP_UBWPLOCK_Msk                 (_UINT32_(0x1) << FCW_UBWP_UBWPLOCK_Pos)             /* (FCW_UBWP) UBWP Lock Bit Mask */
#define FCW_UBWP_UBWPLOCK(value)              (FCW_UBWP_UBWPLOCK_Msk & (_UINT32_(value) << FCW_UBWP_UBWPLOCK_Pos)) /* Assignment of value for UBWPLOCK in the FCW_UBWP register */
#define   FCW_UBWP_UBWPLOCK_UNLOCKED_Val      _UINT32_(0x0)                                        /* (FCW_UBWP) This register is NOT Locked and can be modified  */
#define   FCW_UBWP_UBWPLOCK_LOCKED_Val        _UINT32_(0x1)                                        /* (FCW_UBWP) This register is Locked and cannot be modified  */
#define FCW_UBWP_UBWPLOCK_UNLOCKED            (FCW_UBWP_UBWPLOCK_UNLOCKED_Val << FCW_UBWP_UBWPLOCK_Pos) /* (FCW_UBWP) This register is NOT Locked and can be modified Position */
#define FCW_UBWP_UBWPLOCK_LOCKED              (FCW_UBWP_UBWPLOCK_LOCKED_Val << FCW_UBWP_UBWPLOCK_Pos) /* (FCW_UBWP) This register is Locked and cannot be modified Position */
#define FCW_UBWP_Msk                          _UINT32_(0x80000003)                                 /* (FCW_UBWP) Register Mask  */


/* -------- FCW_UOWP : (FCW Offset: 0x78) (R/W 32) User OTP Write protection REGISTER -------- */
#define FCW_UOWP_RESETVALUE                   _UINT32_(0x0F)                                       /*  (FCW_UOWP) User OTP Write protection REGISTER  Reset Value */

#define FCW_UOWP_UO1WPR_Pos                   _UINT32_(0)                                          /* (FCW_UOWP) User OTP Page 1 Write Protect Row Bit Position */
#define FCW_UOWP_UO1WPR_Msk                   (_UINT32_(0xF) << FCW_UOWP_UO1WPR_Pos)               /* (FCW_UOWP) User OTP Page 1 Write Protect Row Bit Mask */
#define FCW_UOWP_UO1WPR(value)                (FCW_UOWP_UO1WPR_Msk & (_UINT32_(value) << FCW_UOWP_UO1WPR_Pos)) /* Assignment of value for UO1WPR in the FCW_UOWP register */
#define   FCW_UOWP_UO1WPR_DISABLE_Val         _UINT32_(0x0)                                        /* (FCW_UOWP) Write Protection for User OTP Page 1 Row "n" is Disabled  */
#define   FCW_UOWP_UO1WPR_ENABLE_Val          _UINT32_(0x1)                                        /* (FCW_UOWP) Write Protection for User OTP Page 1 Row "n" is Enabled  */
#define FCW_UOWP_UO1WPR_DISABLE               (FCW_UOWP_UO1WPR_DISABLE_Val << FCW_UOWP_UO1WPR_Pos) /* (FCW_UOWP) Write Protection for User OTP Page 1 Row "n" is Disabled Position */
#define FCW_UOWP_UO1WPR_ENABLE                (FCW_UOWP_UO1WPR_ENABLE_Val << FCW_UOWP_UO1WPR_Pos)  /* (FCW_UOWP) Write Protection for User OTP Page 1 Row "n" is Enabled Position */
#define FCW_UOWP_UO1WPRLOCK_Pos               _UINT32_(16)                                         /* (FCW_UOWP) User OTP Page 1 WP Row Lock Bit Position */
#define FCW_UOWP_UO1WPRLOCK_Msk               (_UINT32_(0xF) << FCW_UOWP_UO1WPRLOCK_Pos)           /* (FCW_UOWP) User OTP Page 1 WP Row Lock Bit Mask */
#define FCW_UOWP_UO1WPRLOCK(value)            (FCW_UOWP_UO1WPRLOCK_Msk & (_UINT32_(value) << FCW_UOWP_UO1WPRLOCK_Pos)) /* Assignment of value for UO1WPRLOCK in the FCW_UOWP register */
#define   FCW_UOWP_UO1WPRLOCK_UNLOCKED_Val    _UINT32_(0x0)                                        /* (FCW_UOWP) UO1WPR[n] &amp; UO1WPRLOCK[n] bits are NOT Locked and can be modified  */
#define   FCW_UOWP_UO1WPRLOCK_LOCKED_Val      _UINT32_(0x1)                                        /* (FCW_UOWP) UO1WPR[n] &amp; UO1WPRLOCK[n] bits are Locked and cannot be modified  */
#define FCW_UOWP_UO1WPRLOCK_UNLOCKED          (FCW_UOWP_UO1WPRLOCK_UNLOCKED_Val << FCW_UOWP_UO1WPRLOCK_Pos) /* (FCW_UOWP) UO1WPR[n] &amp; UO1WPRLOCK[n] bits are NOT Locked and can be modified Position */
#define FCW_UOWP_UO1WPRLOCK_LOCKED            (FCW_UOWP_UO1WPRLOCK_LOCKED_Val << FCW_UOWP_UO1WPRLOCK_Pos) /* (FCW_UOWP) UO1WPR[n] &amp; UO1WPRLOCK[n] bits are Locked and cannot be modified Position */
#define FCW_UOWP_Msk                          _UINT32_(0x000F000F)                                 /* (FCW_UOWP) Register Mask  */


/* -------- FCW_CWP : (FCW Offset: 0x7C) (R/W 32) CFM Page Write Protect REGISTER -------- */
#define FCW_CWP_RESETVALUE                    _UINT32_(0x8C008FD)                                  /*  (FCW_CWP) CFM Page Write Protect REGISTER  Reset Value */

#define FCW_CWP_BC1AWP_Pos                    _UINT32_(0)                                          /* (FCW_CWP) Panel 1 Write Protect BootCfg1A Position */
#define FCW_CWP_BC1AWP_Msk                    (_UINT32_(0x1) << FCW_CWP_BC1AWP_Pos)                /* (FCW_CWP) Panel 1 Write Protect BootCfg1A Mask */
#define FCW_CWP_BC1AWP(value)                 (FCW_CWP_BC1AWP_Msk & (_UINT32_(value) << FCW_CWP_BC1AWP_Pos)) /* Assignment of value for BC1AWP in the FCW_CWP register */
#define   FCW_CWP_BC1AWP_DISABLE_Val          _UINT32_(0x0)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FCW_CWP_BC1AWP_ENABLE_Val           _UINT32_(0x1)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FCW_CWP_BC1AWP_DISABLE                (FCW_CWP_BC1AWP_DISABLE_Val << FCW_CWP_BC1AWP_Pos)   /* (FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FCW_CWP_BC1AWP_ENABLE                 (FCW_CWP_BC1AWP_ENABLE_Val << FCW_CWP_BC1AWP_Pos)    /* (FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FCW_CWP_BC1WP_Pos                     _UINT32_(2)                                          /* (FCW_CWP) Panel 1 Write Protect BootCfg1 Position */
#define FCW_CWP_BC1WP_Msk                     (_UINT32_(0x1) << FCW_CWP_BC1WP_Pos)                 /* (FCW_CWP) Panel 1 Write Protect BootCfg1 Mask */
#define FCW_CWP_BC1WP(value)                  (FCW_CWP_BC1WP_Msk & (_UINT32_(value) << FCW_CWP_BC1WP_Pos)) /* Assignment of value for BC1WP in the FCW_CWP register */
#define   FCW_CWP_BC1WP_DISABLE_Val           _UINT32_(0x0)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FCW_CWP_BC1WP_ENABLE_Val            _UINT32_(0x1)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FCW_CWP_BC1WP_DISABLE                 (FCW_CWP_BC1WP_DISABLE_Val << FCW_CWP_BC1WP_Pos)     /* (FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FCW_CWP_BC1WP_ENABLE                  (FCW_CWP_BC1WP_ENABLE_Val << FCW_CWP_BC1WP_Pos)      /* (FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FCW_CWP_RCWP_Pos                      _UINT32_(3)                                          /* (FCW_CWP) Panel 1 Write Protect ROMCfg Position */
#define FCW_CWP_RCWP_Msk                      (_UINT32_(0x1) << FCW_CWP_RCWP_Pos)                  /* (FCW_CWP) Panel 1 Write Protect ROMCfg Mask */
#define FCW_CWP_RCWP(value)                   (FCW_CWP_RCWP_Msk & (_UINT32_(value) << FCW_CWP_RCWP_Pos)) /* Assignment of value for RCWP in the FCW_CWP register */
#define   FCW_CWP_RCWP_DISABLE_Val            _UINT32_(0x0)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FCW_CWP_RCWP_ENABLE_Val             _UINT32_(0x1)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FCW_CWP_RCWP_DISABLE                  (FCW_CWP_RCWP_DISABLE_Val << FCW_CWP_RCWP_Pos)       /* (FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FCW_CWP_RCWP_ENABLE                   (FCW_CWP_RCWP_ENABLE_Val << FCW_CWP_RCWP_Pos)        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FCW_CWP_VSSWP0_Pos                    _UINT32_(4)                                          /* (FCW_CWP) Panel 1 Write Protect VSSn Position */
#define FCW_CWP_VSSWP0_Msk                    (_UINT32_(0x1) << FCW_CWP_VSSWP0_Pos)                /* (FCW_CWP) Panel 1 Write Protect VSSn Mask */
#define FCW_CWP_VSSWP0(value)                 (FCW_CWP_VSSWP0_Msk & (_UINT32_(value) << FCW_CWP_VSSWP0_Pos)) /* Assignment of value for VSSWP0 in the FCW_CWP register */
#define   FCW_CWP_VSSWP0_DISABLE_Val          _UINT32_(0x0)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FCW_CWP_VSSWP0_ENABLE_Val           _UINT32_(0x1)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FCW_CWP_VSSWP0_DISABLE                (FCW_CWP_VSSWP0_DISABLE_Val << FCW_CWP_VSSWP0_Pos)   /* (FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FCW_CWP_VSSWP0_ENABLE                 (FCW_CWP_VSSWP0_ENABLE_Val << FCW_CWP_VSSWP0_Pos)    /* (FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FCW_CWP_VSSWP1_Pos                    _UINT32_(5)                                          /* (FCW_CWP) Panel 1 Write Protect VSSn Position */
#define FCW_CWP_VSSWP1_Msk                    (_UINT32_(0x1) << FCW_CWP_VSSWP1_Pos)                /* (FCW_CWP) Panel 1 Write Protect VSSn Mask */
#define FCW_CWP_VSSWP1(value)                 (FCW_CWP_VSSWP1_Msk & (_UINT32_(value) << FCW_CWP_VSSWP1_Pos)) /* Assignment of value for VSSWP1 in the FCW_CWP register */
#define   FCW_CWP_VSSWP1_DISABLE_Val          _UINT32_(0x0)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FCW_CWP_VSSWP1_ENABLE_Val           _UINT32_(0x1)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FCW_CWP_VSSWP1_DISABLE                (FCW_CWP_VSSWP1_DISABLE_Val << FCW_CWP_VSSWP1_Pos)   /* (FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FCW_CWP_VSSWP1_ENABLE                 (FCW_CWP_VSSWP1_ENABLE_Val << FCW_CWP_VSSWP1_Pos)    /* (FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FCW_CWP_TWP_Pos                       _UINT32_(6)                                          /* (FCW_CWP) Panel 1 Write Protect Test Position */
#define FCW_CWP_TWP_Msk                       (_UINT32_(0x1) << FCW_CWP_TWP_Pos)                   /* (FCW_CWP) Panel 1 Write Protect Test Mask */
#define FCW_CWP_TWP(value)                    (FCW_CWP_TWP_Msk & (_UINT32_(value) << FCW_CWP_TWP_Pos)) /* Assignment of value for TWP in the FCW_CWP register */
#define   FCW_CWP_TWP_DISABLE_Val             _UINT32_(0x0)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FCW_CWP_TWP_ENABLE_Val              _UINT32_(0x1)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Enable  */
#define FCW_CWP_TWP_DISABLE                   (FCW_CWP_TWP_DISABLE_Val << FCW_CWP_TWP_Pos)         /* (FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FCW_CWP_TWP_ENABLE                    (FCW_CWP_TWP_ENABLE_Val << FCW_CWP_TWP_Pos)          /* (FCW_CWP) Erase and Write Protection for this Page is Enable Position */
#define FCW_CWP_COWP_Pos                      _UINT32_(7)                                          /* (FCW_CWP) Panel 1 Write Protect CalOTP Position */
#define FCW_CWP_COWP_Msk                      (_UINT32_(0x1) << FCW_CWP_COWP_Pos)                  /* (FCW_CWP) Panel 1 Write Protect CalOTP Mask */
#define FCW_CWP_COWP(value)                   (FCW_CWP_COWP_Msk & (_UINT32_(value) << FCW_CWP_COWP_Pos)) /* Assignment of value for COWP in the FCW_CWP register */
#define   FCW_CWP_COWP_DISABLE_Val            _UINT32_(0x0)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Disabled  */
#define   FCW_CWP_COWP_ENABLE_Val             _UINT32_(0x1)                                        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled  */
#define FCW_CWP_COWP_DISABLE                  (FCW_CWP_COWP_DISABLE_Val << FCW_CWP_COWP_Pos)       /* (FCW_CWP) Erase and Write Protection for this Page is Disabled Position */
#define FCW_CWP_COWP_ENABLE                   (FCW_CWP_COWP_ENABLE_Val << FCW_CWP_COWP_Pos)        /* (FCW_CWP) Erase and Write Protection for this Page is Enabled Position */
#define FCW_CWP_BC1AWPLOCK_Pos                _UINT32_(16)                                         /* (FCW_CWP) Panel 1 Lock Write Protection BootCfg1A Position */
#define FCW_CWP_BC1AWPLOCK_Msk                (_UINT32_(0x1) << FCW_CWP_BC1AWPLOCK_Pos)            /* (FCW_CWP) Panel 1 Lock Write Protection BootCfg1A Mask */
#define FCW_CWP_BC1AWPLOCK(value)             (FCW_CWP_BC1AWPLOCK_Msk & (_UINT32_(value) << FCW_CWP_BC1AWPLOCK_Pos)) /* Assignment of value for BC1AWPLOCK in the FCW_CWP register */
#define   FCW_CWP_BC1AWPLOCK_UNLOCKED_Val     _UINT32_(0x0)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FCW_CWP_BC1AWPLOCK_LOCKED_Val       _UINT32_(0x1)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FCW_CWP_BC1AWPLOCK_UNLOCKED           (FCW_CWP_BC1AWPLOCK_UNLOCKED_Val << FCW_CWP_BC1AWPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FCW_CWP_BC1AWPLOCK_LOCKED             (FCW_CWP_BC1AWPLOCK_LOCKED_Val << FCW_CWP_BC1AWPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FCW_CWP_BC1WPLOCK_Pos                 _UINT32_(18)                                         /* (FCW_CWP) Panel 1 Lock Write Protection BootCfg1 Position */
#define FCW_CWP_BC1WPLOCK_Msk                 (_UINT32_(0x1) << FCW_CWP_BC1WPLOCK_Pos)             /* (FCW_CWP) Panel 1 Lock Write Protection BootCfg1 Mask */
#define FCW_CWP_BC1WPLOCK(value)              (FCW_CWP_BC1WPLOCK_Msk & (_UINT32_(value) << FCW_CWP_BC1WPLOCK_Pos)) /* Assignment of value for BC1WPLOCK in the FCW_CWP register */
#define   FCW_CWP_BC1WPLOCK_UNLOCKED_Val      _UINT32_(0x0)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FCW_CWP_BC1WPLOCK_LOCKED_Val        _UINT32_(0x1)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FCW_CWP_BC1WPLOCK_UNLOCKED            (FCW_CWP_BC1WPLOCK_UNLOCKED_Val << FCW_CWP_BC1WPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FCW_CWP_BC1WPLOCK_LOCKED              (FCW_CWP_BC1WPLOCK_LOCKED_Val << FCW_CWP_BC1WPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FCW_CWP_RCWPLOCK_Pos                  _UINT32_(19)                                         /* (FCW_CWP) Panel 1 Lock Write Protection ROMCfg Position */
#define FCW_CWP_RCWPLOCK_Msk                  (_UINT32_(0x1) << FCW_CWP_RCWPLOCK_Pos)              /* (FCW_CWP) Panel 1 Lock Write Protection ROMCfg Mask */
#define FCW_CWP_RCWPLOCK(value)               (FCW_CWP_RCWPLOCK_Msk & (_UINT32_(value) << FCW_CWP_RCWPLOCK_Pos)) /* Assignment of value for RCWPLOCK in the FCW_CWP register */
#define   FCW_CWP_RCWPLOCK_UNLOCKED_Val       _UINT32_(0x0)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FCW_CWP_RCWPLOCK_LOCKED_Val         _UINT32_(0x1)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FCW_CWP_RCWPLOCK_UNLOCKED             (FCW_CWP_RCWPLOCK_UNLOCKED_Val << FCW_CWP_RCWPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FCW_CWP_RCWPLOCK_LOCKED               (FCW_CWP_RCWPLOCK_LOCKED_Val << FCW_CWP_RCWPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FCW_CWP_VSSWPLOCK0_Pos                _UINT32_(20)                                         /* (FCW_CWP) Panel 1 Lock Write Protection VSSn Position */
#define FCW_CWP_VSSWPLOCK0_Msk                (_UINT32_(0x1) << FCW_CWP_VSSWPLOCK0_Pos)            /* (FCW_CWP) Panel 1 Lock Write Protection VSSn Mask */
#define FCW_CWP_VSSWPLOCK0(value)             (FCW_CWP_VSSWPLOCK0_Msk & (_UINT32_(value) << FCW_CWP_VSSWPLOCK0_Pos)) /* Assignment of value for VSSWPLOCK0 in the FCW_CWP register */
#define   FCW_CWP_VSSWPLOCK0_UNLOCKED_Val     _UINT32_(0x0)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FCW_CWP_VSSWPLOCK0_LOCKED_Val       _UINT32_(0x1)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FCW_CWP_VSSWPLOCK0_UNLOCKED           (FCW_CWP_VSSWPLOCK0_UNLOCKED_Val << FCW_CWP_VSSWPLOCK0_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FCW_CWP_VSSWPLOCK0_LOCKED             (FCW_CWP_VSSWPLOCK0_LOCKED_Val << FCW_CWP_VSSWPLOCK0_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FCW_CWP_VSSWPLOCK1_Pos                _UINT32_(21)                                         /* (FCW_CWP) Panel 1 Lock Write Protection VSSn Position */
#define FCW_CWP_VSSWPLOCK1_Msk                (_UINT32_(0x1) << FCW_CWP_VSSWPLOCK1_Pos)            /* (FCW_CWP) Panel 1 Lock Write Protection VSSn Mask */
#define FCW_CWP_VSSWPLOCK1(value)             (FCW_CWP_VSSWPLOCK1_Msk & (_UINT32_(value) << FCW_CWP_VSSWPLOCK1_Pos)) /* Assignment of value for VSSWPLOCK1 in the FCW_CWP register */
#define   FCW_CWP_VSSWPLOCK1_UNLOCKED_Val     _UINT32_(0x0)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FCW_CWP_VSSWPLOCK1_LOCKED_Val       _UINT32_(0x1)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FCW_CWP_VSSWPLOCK1_UNLOCKED           (FCW_CWP_VSSWPLOCK1_UNLOCKED_Val << FCW_CWP_VSSWPLOCK1_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FCW_CWP_VSSWPLOCK1_LOCKED             (FCW_CWP_VSSWPLOCK1_LOCKED_Val << FCW_CWP_VSSWPLOCK1_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FCW_CWP_TWPLOCK_Pos                   _UINT32_(22)                                         /* (FCW_CWP) Panel 1 Lock Write Protection Test Position */
#define FCW_CWP_TWPLOCK_Msk                   (_UINT32_(0x1) << FCW_CWP_TWPLOCK_Pos)               /* (FCW_CWP) Panel 1 Lock Write Protection Test Mask */
#define FCW_CWP_TWPLOCK(value)                (FCW_CWP_TWPLOCK_Msk & (_UINT32_(value) << FCW_CWP_TWPLOCK_Pos)) /* Assignment of value for TWPLOCK in the FCW_CWP register */
#define   FCW_CWP_TWPLOCK_UNLOCKED_Val        _UINT32_(0x0)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FCW_CWP_TWPLOCK_LOCKED_Val          _UINT32_(0x1)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FCW_CWP_TWPLOCK_UNLOCKED              (FCW_CWP_TWPLOCK_UNLOCKED_Val << FCW_CWP_TWPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FCW_CWP_TWPLOCK_LOCKED                (FCW_CWP_TWPLOCK_LOCKED_Val << FCW_CWP_TWPLOCK_Pos)  /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FCW_CWP_COWPLOCK_Pos                  _UINT32_(23)                                         /* (FCW_CWP) Panel 1 Lock Write Protection CalOTP Position */
#define FCW_CWP_COWPLOCK_Msk                  (_UINT32_(0x1) << FCW_CWP_COWPLOCK_Pos)              /* (FCW_CWP) Panel 1 Lock Write Protection CalOTP Mask */
#define FCW_CWP_COWPLOCK(value)               (FCW_CWP_COWPLOCK_Msk & (_UINT32_(value) << FCW_CWP_COWPLOCK_Pos)) /* Assignment of value for COWPLOCK in the FCW_CWP register */
#define   FCW_CWP_COWPLOCK_UNLOCKED_Val       _UINT32_(0x0)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified  */
#define   FCW_CWP_COWPLOCK_LOCKED_Val         _UINT32_(0x1)                                        /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified  */
#define FCW_CWP_COWPLOCK_UNLOCKED             (FCW_CWP_COWPLOCK_UNLOCKED_Val << FCW_CWP_COWPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are NOT Locked and can be modified Position */
#define FCW_CWP_COWPLOCK_LOCKED               (FCW_CWP_COWPLOCK_LOCKED_Val << FCW_CWP_COWPLOCK_Pos) /* (FCW_CWP) The Lock &amp; Write Protect bits for this Page are Locked and cannot be modified Position */
#define FCW_CWP_Msk                           _UINT32_(0x00FD00FD)                                 /* (FCW_CWP) Register Mask  */

